## Staging: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          NAME                           |
|----------|---------------------------------------------------------|
| update   | `aws_cloudfront_distribution.scan_files_api`            |
| recreate | `aws_lambda_function_url.scan_files[&quot;api&quot;]`             |
|          | `aws_lambda_function_url.scan_files[&quot;api-provisioned&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudfront_distribution.scan_files_api will be updated in-place
  ~ resource "aws_cloudfront_distribution" "scan_files_api" {
        id                             = "E2E41JYAWEFURP"
        tags                           = {
            "CostCentre" = "scan-files-staging"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "wvwwy6sspuwy335ta7hpg5zxza0hdyyf.lambda-url.ca-central-1.on.aws" -> null
          - origin_id           = "scan-files-api" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "https-only" -> null
              - origin_read_timeout      = 60 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "scan-files-api"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 60
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function_url.scan_files["api"] must be replaced
-/+ resource "aws_lambda_function_url" "scan_files" {
      ~ function_arn       = "arn:aws:lambda:ca-central-1:127893201980:function:scan-files-api" -> (known after apply)
      ~ function_url       = "https://wvwwy6sspuwy335ta7hpg5zxza0hdyyf.lambda-url.ca-central-1.on.aws/" -> (known after apply)
      ~ id                 = "scan-files-api" -> (known after apply)
      + qualifier          = "$LATEST" # forces replacement
      ~ url_id             = "wvwwy6sspuwy335ta7hpg5zxza0hdyyf" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_function_url.scan_files["api-provisioned"] must be replaced
-/+ resource "aws_lambda_function_url" "scan_files" {
      ~ function_arn       = "arn:aws:lambda:ca-central-1:127893201980:function:scan-files-api-provisioned" -> (known after apply)
      ~ function_url       = "https://thstp3uhxudac7d7qdyysm4dqy0woovf.lambda-url.ca-central-1.on.aws/" -> (known after apply)
      ~ id                 = "scan-files-api-provisioned" -> (known after apply)
      + qualifier          = "latest" # forces replacement
      ~ url_id             = "thstp3uhxudac7d7qdyysm4dqy0woovf" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ function_url = (sensitive value)

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 10 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
